#include <iostream>

using namespace std;


int main() {
	setlocale(LC_ALL, "RU");


	string num;
	string name;
	string namep1;
	string namep2;
	string nam1;
	string nam2;
	string minus = "Минус ";
	
	int comp1;
	int comp2;

	cout << "Введите первое число: ";					//Первое число
	cin >> num;
	cout << endl;

	if (num[0] == '-') {				//Отрицательные числа
		if (num[2] == NULL) {
			comp1 = -(num[1] - 48);
			name = (num[1] == '0') ? "Ноль" :
				(num[1] == '1') ? "Один" :
				(num[1] == '2') ? "Два" :
				(num[1] == '3') ? "Три" :
				(num[1] == '4') ? "Четыре" :
				(num[1] == '5') ? "Пять" :
				(num[1] == '6') ? "Шесть" :
				(num[1] == '7') ? "Семь" :
				(num[1] == '8') ? "Восемь" :
				"Девять";
		}



		else if (num[1] == '1') {
			name = (num[2] == '0') ? "Десять" :
				(num[2] == '1') ? "Одиннадцать" :
				(num[2] == '2') ? "Двенадцать" :
				(num[2] == '3') ? "Тринадцать" :
				(num[2] == '4') ? "Четырнадцать" :
				(num[2] == '5') ? "Пятнадцать" :
				(num[2] == '6') ? "Шестнадцать" :
				(num[2] == '7') ? "Семнадцать" :
				(num[2] == '8') ? "Восемннадцать" :
				"Девятнадцать";
			comp1 = -((num[1] - 48) * 10 + ((num[1] - 48)));
		}



		else {

			namep1 = (num[1] == '2') ? "Двадцать" :
				(num[1] == '3') ? "Тридцать" :
				(num[1] == '4') ? "Сорок" :
				(num[1] == '5') ? "Пятьдесят" :
				(num[1] == '6') ? "Шестьдесят" :
				(num[1] == '7') ? "Семьдесят" :
				(num[1] == '8') ? "Восемьдесят" :
				"Девяносто";

			namep2 = (num[2] == '0') ? " " :
				(num[2] == '1') ? " один" :
				(num[2] == '2') ? " два" :
				(num[2] == '3') ? " три" :
				(num[2] == '4') ? " четыре" :
				(num[2] == '5') ? " пять" :
				(num[2] == '6') ? " шесть" :
				(num[2] == '7') ? " семь" :
				(num[2] == '8') ? " восемь" :
				" девять";

			name = namep1.append(namep2);
			comp1 = -(num[1] - 48) * 10 + ((num[1] - 48));
		}

		
		nam1 = minus.append(name);
	}

	else {										//Положительные числа
		if (num[1] == NULL) {
			comp1 = (num[0] - 48);
			name = (num[0] == '0') ? "Ноль" :
				(num[0] == '1') ? "Один" :
				(num[0] == '2') ? "Два" :
				(num[0] == '3') ? "Три" :
				(num[0] == '4') ? "Четыре" :
				(num[0] == '5') ? "Пять" :
				(num[0] == '6') ? "Шесть" :
				(num[0] == '7') ? "Семь" :
				(num[0] == '8') ? "Восемь" :
				"Девять";
		}



		else if (num[0] == '1') {
			name = (num[1] == '0') ? "Десять" :
				(num[1] == '1') ? "Одиннадцать" :
				(num[1] == '2') ? "Двенадцать" :
				(num[1] == '3') ? "Тринадцать" :
				(num[1] == '4') ? "Четырнадцать" :
				(num[1] == '5') ? "Пятнадцать" :
				(num[1] == '6') ? "Шестнадцать" :
				(num[1] == '7') ? "Семнадцать" :
				(num[1] == '8') ? "Восемннадцать" :
				"Девятнадцать";
			comp1 = (num[0] - 48) * 10 + ((num[1] - 48));
		}



		else {

			namep1 = (num[0] == '2') ? "Двадцать" :
				(num[0] == '3') ? "Тридцать" :
				(num[0] == '4') ? "Сорок" :
				(num[0] == '5') ? "Пятьдесят" :
				(num[0] == '6') ? "Шестьдесят" :
				(num[0] == '7') ? "Семьдесят" :
				(num[0] == '8') ? "Восемьдесят" :
				"Девяносто";
			//Похоже, что Тед Качински всё-таки был прав

			namep2 = (num[1] == '0') ? " " :
				(num[1] == '1') ? " один" :
				(num[1] == '2') ? " два" :
				(num[1] == '3') ? " три" :
				(num[1] == '4') ? " четыре" :
				(num[1] == '5') ? " пять" :
				(num[1] == '6') ? " шесть" :
				(num[1] == '7') ? " семь" :
				(num[1] == '8') ? " восемь" :
				" девять";

			name = namep1.append(namep2);
			comp1 = (num[0] - 48) * 10 + ((num[1] - 48));
		}

		nam1 = name;
	}


	

	minus = "Минус ";



	cout << "Введите второе число: ";						//Второе число
	cin >> num;
	cout << endl;

	if (num[0] == '-') {				//Отрицательные числа
		if (num[2] == NULL) {
			comp2 = -(num[1] - 48);
			name = (num[1] == '0') ? "Ноль" :
				(num[1] == '1') ? "Один" :
				(num[1] == '2') ? "Два" :
				(num[1] == '3') ? "Три" :
				(num[1] == '4') ? "Четыре" :
				(num[1] == '5') ? "Пять" :
				(num[1] == '6') ? "Шесть" :
				(num[1] == '7') ? "Семь" :
				(num[1] == '8') ? "Восемь" :
				"Девять";
		}



		else if (num[1] == '1') {
			name = (num[2] == '0') ? "Десять" :
				(num[2] == '1') ? "Одиннадцать" :
				(num[2] == '2') ? "Двенадцать" :
				(num[2] == '3') ? "Тринадцать" :
				(num[2] == '4') ? "Четырнадцать" :
				(num[2] == '5') ? "Пятнадцать" :
				(num[2] == '6') ? "Шестнадцать" :
				(num[2] == '7') ? "Семнадцать" :
				(num[2] == '8') ? "Восемннадцать" :
				"Девятнадцать";
			comp2 = -((num[1] - 48) * 10 + ((num[1] - 48)));
		}



		else {

			namep1 = (num[1] == '2') ? "Двадцать" :
				(num[1] == '3') ? "Тридцать" :
				(num[1] == '4') ? "Сорок" :
				(num[1] == '5') ? "Пятьдесят" :
				(num[1] == '6') ? "Шестьдесят" :
				(num[1] == '7') ? "Семьдесят" :
				(num[1] == '8') ? "Восемьдесят" :
				"Девяносто";

			namep2 = (num[2] == '0') ? " " :
				(num[2] == '1') ? " один" :
				(num[2] == '2') ? " два" :
				(num[2] == '3') ? " три" :
				(num[2] == '4') ? " четыре" :
				(num[2] == '5') ? " пять" :
				(num[2] == '6') ? " шесть" :
				(num[2] == '7') ? " семь" :
				(num[2] == '8') ? " восемь" :
				" девять";

			name = namep1.append(namep2);
			comp2 = -(num[1] - 48) * 10 + ((num[1] - 48));
		}


		nam2 = minus.append(name);
	}

	else {										//Положительные числа
		if (num[1] == NULL) {
			comp2 = (num[0] - 48);
			name = (num[0] == '0') ? "Ноль" :
				(num[0] == '1') ? "Один" :
				(num[0] == '2') ? "Два" :
				(num[0] == '3') ? "Три" :
				(num[0] == '4') ? "Четыре" :
				(num[0] == '5') ? "Пять" :
				(num[0] == '6') ? "Шесть" :
				(num[0] == '7') ? "Семь" :
				(num[0] == '8') ? "Восемь" :
				"Девять";
		}



		else if (num[0] == '1') {
			name = (num[1] == '0') ? "Десять" :
				(num[1] == '1') ? "Одиннадцать" :
				(num[1] == '2') ? "Двенадцать" :
				(num[1] == '3') ? "Тринадцать" :
				(num[1] == '4') ? "Четырнадцать" :
				(num[1] == '5') ? "Пятнадцать" :
				(num[1] == '6') ? "Шестнадцать" :
				(num[1] == '7') ? "Семнадцать" :
				(num[1] == '8') ? "Восемннадцать" :
				"Девятнадцать";
			comp2 = (num[0] - 48) * 10 + ((num[1] - 48));
		}



		else {

			namep1 = (num[0] == '2') ? "Двадцать" :
				(num[0] == '3') ? "Тридцать" :
				(num[0] == '4') ? "Сорок" :
				(num[0] == '5') ? "Пятьдесят" :
				(num[0] == '6') ? "Шестьдесят" :
				(num[0] == '7') ? "Семьдесят" :
				(num[0] == '8') ? "Восемьдесят" :
				"Девяносто";

			namep2 = (num[1] == '0') ? " " :
				(num[1] == '1') ? " один" :
				(num[1] == '2') ? " два" :
				(num[1] == '3') ? " три" :
				(num[1] == '4') ? " четыре" :
				(num[1] == '5') ? " пять" :
				(num[1] == '6') ? " шесть" :
				(num[1] == '7') ? " семь" :
				(num[1] == '8') ? " восемь" :
				" девять";

			name = namep1.append(namep2);
			comp2 = (num[0] - 48) * 10 + ((num[1] - 48));
		}

		nam2 = name;
	}






	if (comp1 > comp2) {
		cout << nam1 << " больше чем " << nam2;
	}
	else if (comp1 < comp2) {
		cout << nam1 << " меньше чем " << nam2;
	}
	else {
		cout << nam1 << " равно " << nam2;
	}


	//Я понятия не имею, как ,ничего не сломав, заставить этот кошмар писать сообщение об ошибке. Простите


	return 0;
}
